Repository: MurhafMoussa/pasco-shipping
Catalog: flutter_boilerplate_dash/lib/l10n/intl_*.arb
Languages: ar

source: Loading
ar: جار التحميل

source: Please Enter Your Email
ar: الرجاء ادخال البريد الالكتروني

source: I have an account
ar: لدي حساب

source: GET STARTED
ar: البدء

source: Sign Up
ar: إنشاء حساب

source: Sign In
ar: تسجيل الدخول

source: Welcome
ar: أهلا

source: Email
ar: البريد الإلكتروني

source: Password is too short
ar: كلمة المرور قصيرة جدا

source: Password
ar: كلمة السر

# confirmPass
source: Confirm Password
ar: تأكيد كلمة السر

# required
source: this filed is required
ar: الحقل مطلوب

# noAccount
source: I have no account? sign up
ar: ليس لديك حساب ؟ إنشاء حساب

source: confirm
ar: تأكيد

# pleaseInputPhoneNumber
source: pleas input phone number
ar: أدخل الرقم

source: confirm Code
ar: تأكيد الرمز

source: Success!!!
ar: نجاح!!!

# loggedIn
source: You are logged in successfully
ar: تم تسجيل الدخول بنجاح

source: OK
ar: تم

# shipment
source: Shipments
ar: الشحنات

# myShipment
source: My Shipments
ar: شحناتي

# newShipmentRequest
source: Request a new shipment
ar: طلب شحنة جديد

source: Profile
ar: الملف الشخصي

source: Marks
ar: العلامات

source: Home
ar: الرئيسية

source: Notification
ar: الإشعارت

source: Direct support
ar: دعم مباشر

# enterShipmentNumber
source: Enter the shipment number
ar: أدخل رقم الشحنة

source: Contact Info
ar: معلومات التواصل

source: About Us
ar: حول

# privacy
source: Privacy Policy
ar: سياسة الخصوصية

source: Term Of Service
ar: شروط الخدمة

source: Setting
ar: الإعدادات

source: Logout
ar: تسجيل الخروج

# enterMark
source: Enter new mark
ar: أدخل علامة جديدة

source: Previous Mark
ar: العلامات السابقة

# deletePreviousMark
source: You cannot delete previously used marks
ar: لا يمكنك حذف العلامات المستخدمة سابقا

source: My Previous
ar: علاماتي السابقة

source: Country
ar: البلد

source: City
ar: المدينة

source: Phone
ar: الهاتف

source: Location
ar: الموقع

# saveInfo
source: Save Information
ar: حفظ المعلومات

# resultTrack
source: Result tracking
ar: نتائج التعقب

# trackShipment
source: Tracking the shipment
ar: تعقب شحنة

source: Important note
ar: ملاحظة مهمة

# inHolder
source: Is in one holder
ar: في حامل واحد:

source: Import warehouse city:
ar: مدينة الإستلام:

source: Distributor Name:
ar: اسم الموزع:

source: Shipment Info
ar: معلومات الشحنة

source: Review Shipment
ar: مراجعة الشحنة

source: name here
ar: لأسم هنا

source: start writing
ar: أبدء بالكتابة

source: language
ar: اللغة

source: dark mode
ar: الوضع الليلي

source: Save
ar: حفظ

source: cancel
ar: إلغاء

# fillAllField
source: fill all filed
ar: إملئ جميع الحقول

source: Request Shipment
ar: طلب شحنة

source: Shipping way:
ar: طريقة الشحن

source: Sea
ar: بحري

source: Air
ar: جوي

source: Shipping from:
ar: شحن من:

source: Shipping to:
ar: شحن إلى:

source: Product type:
ar: نوع المنتجات:

source: Quantity:
ar: الكمية:

source: Image:
ar: صورة:

source: Countries
ar: البلدان

source: Distributors
ar: الموزعين

# proxies
source: Agents
ar: الوكلاء

source: Subcontract
ar: مزودي الخدمة

# subcontractService
source: Subcontract Services
ar: الخدمات

source: Service
ar: الخدمة

# suppliers
source: Supplier
ar: الموردين

source: Units
ar: الوحدات

# view
source: View all
ar: عرض الكل

# add
source: Add new
ar: إضافة جديد

# addedSuccessfully
source: Item added successfully
ar: تم إضافة العنصر بنجاح

source: Description:
ar: الوصف

source: Air Waybill Type
ar: نوع بوليصة الشحن الجوي

source: Air Waybill Number
ar: رقم بوليصة الشحن الجوي:

source: number
ar: الرقم

# provided
source: Provided by
ar: مُفدمة من

source: Consignee
ar: المرسل إليه

source: Shipper
ar: الشاحن

source: Carrier
ar: الناقل

# specification
source: Types
ar: أنواع

source: choose
ar: اختر

source: Shipping Type
ar: نوع الشحن

source: Container Number
ar: رقم الحاوية

source: Total Cost:
ar: الكلفة الكلية:

source: Nothing Added
ar: لا شيء مضاف

source: Cost
ar: الكلفة

source: Details
ar: التفاصيل

source: Uploaded
ar: تحميل

source: Cleared
ar: جمركة

source: Arrived
ar: تفريغ

source: Air Waybill Information
ar: معلومات بوليصة الشحن الجوي

source: Container Information
ar: معلومات الحاوية

source: Type
ar: النوع

source: Requested by:
ar: بطلب من:

source: Requested at:
ar: طُلبت في:

source: Shipment Information
ar: معلومات الشحنات

# noShipmentAdd
source: No shipment has been added
ar: لم يتم إضافة اي شحنة

# notFull
source: Not full yet
ar: غير ممتلئة بعد

source: Full
ar: ممتلئة

# haveSpace
source: You still have some space
ar: مازلت تمتلك بعض المساحة

# noSpace
source: You don't have any space
ar: ليس لديك أي مساحة

source: Track Number:
ar: رقم التعقب:

source: Weight:
ar: الوزن:

source: Product Category:
ar: نوع البضائع:

# targetWarehouse
source: Target City :
ar: المدينة الهدف:

source: Export Warehouse :
ar: مستودع التصدير:

source: Air Waybill Status
ar: حالة بوليصة الشحن الجوي

source: Container Status
ar: حالة الحاوية

source: Next Status
ar: الحالة التالية

# noChangeStatus
source: You cannot change the state, the container is not full
ar: لا يمكنك تغير الحالة,الحاوية غير ممتلئة بعد

source: Status
ar: الحالة

source: Created At:
ar: تم الإنشاء في:

source: Updated At:
ar: تم التحديث في:

source: Created By:
ar: تم إنشاؤه بواسطة:

source: Updated By:
ar: تم تحديثه بواسطة:

source: Stage Cost:
ar: تكلفة المرحلة:

source: Filter By
ar: تصنف بواسطة

# airwaybillFinance
source: Air Waybill Finances
ar: مصاريف بوليصة الشحن الجوي

# containerFinance
source: Container Finances
ar: مصاريف الحاوية

source: Air Waybills
ar: بوليصات الشحن الجوي

source: Containers
ar: الحاويات

source: Shipment Review
ar: مراجعة الشحنة

source: Supplier Info:
ar: معلومات المورد:

source: Receiver Info:
ar: معلومات المستلم:

source: Name:
ar: الاسم:

source: Unit:
ar: وحدة التغليف:

source: Mark:
ar: العلامة:

source: Payment time:
ar: وقت الدفع:

source: Extra specification:
ar: تفاصيل إضافية:

# containerSpecification
source: Container Type
ar: أنواع الحاوية

# airwaybillSpecification
source: Air waybill Type
ar: أنواع بوليصة الشحن الجوي

# width
source: Weight
ar: الوزن

source: Capacity CPM:
ar: السعه CPM:

source: Length In Meter:
ar: الطول بالمتر:

source: Height In Meter:
ar: الإرتفاع بالمتر:

source: Width In Meter:
ar: العرض بالمتر

source: Calling code:
ar: رمز الاتصال:

source: Import
ar: استراد

source: Export
ar: تصدير

source: Country Type:
ar: نمط الدولة:

source: Edit
ar: تعديل

source: Delete
ar: حذف

source: Address
ar: العنوان

source: Clients
ar: العملاء

source: Client:
ar: العميل:

source: Sub Category
ar: فئة فرعية

source: Category
ar: فئة رئيسية

source: Shipment add successfully
ar: تم طلب الشحنة بنجاح

source: External Warehouse:
ar: مستودع خارجي:

# truee
source: True
ar: صح

# falsee
source: False
ar: خطأ

source: Warehouse Info:
ar: معلومات المستودع:

source: Next
ar: التالي

source: Back
ar: السابق

source: Submit
ar: تأكيد

source: Distributor
ar: الموزع:

# holderType
source: Container / Air waybill Type
ar: نوع الحاوية/بوليصة الشحن الجوي:

# vehicleNumber
source: Vehicle identification number (if vehicle)
ar: رقم تعريف السيارة

source: Accepted Shipment
ar: الشحنات المقبولة

source: Shipment Status
ar: حالة الشحنة

source: Shipment Finance
ar: مصاريف شحنة

source: Show Finance
ar: عرض المصاريف

source: Measured
ar: القياس

source: Received
ar: الإستلام

source: Waiting Shipment
ar: الشحنات المُنتظرة

source: Reject
ar: رفض

source: accept
ar: قبول

source: Service Name:
ar: نوع الخدمة

source: Travel Finance
ar: مصاريف الرحلة

source: Travel Number
ar: رقم الرحلة

source: Launch Country
ar: دولة الإنطلاق

source: Start Date
ar: تاريخ البداية

source: Start Time
ar: وقت البداية

source: Destination Country
ar: دولة الوصول

source: Arrival Date
ar: تاريخ الوصول

source: Arrival Time
ar: وقت الوصول

# networkError
source: There is problem with your connection , please try again
ar: هناك مشكلة بالاتصال بالشبكة الرجاء إعادة المحاولة لاحقا

# invalidCredentials
source: Wrong username or password
ar: هناك خطأ في كلمة السر أو اسم المستخدم

# statusCodeOk
source: Data fetched succesfuly
ar: تم جلب المعلومات بنجاح

# statusCodeCreated
source: The request has succeeded and a new resource has been created as a result
ar: نجح الطلب وتم إنشاء تغيير جديد نتيجة لذلك

# statusCodeBadRequest
source: The server could not understand the request due to invalid syntax
ar: تعذر على الخادم فهم الطلب

# statusCodeUnauthorized
source: Unauthorized
ar: أنت غير مخول بالقيام بهذا الطلب

# StatusCodeNotFound
source: Data not found
ar: لم يتمكن الخادم من العثور على طلبك

source: Internal server error
ar: هناك مشكلة ما في الخادم

# dataDecodeError
source: Error with Decoding Data
ar: هناك مشكلة في تفسير البيانات

source: Error Happened
ar: حدث خطأ ما

# registerSuccess
source: Your account has been registered successfully
ar: تم تسجيل حسابك بنجاح

source: In External Warehouse
ar: في مستودع خارجي

source: In Local Warehouse
ar: في مستودع محلي

source: Air shipment
ar: شحنات جوية

source: Sea shipment
ar: شحنات بحرية

source: Air travel
ar: رحلات جوية

source: Sea travel
ar: رحلات بحرية

source: Extensional Info
ar: معلومات موسعة

source: Other Data
ar: معلومات اخرى

source: Users
ar: المستخدمين

source: Employees
ar: الموظفيين

source: Started
ar: المنطلقة

# currentt
source: Current
ar: الحالية

source: Dashboard
ar: لوحة التحكم

source: Travels
ar: الرحلات

source: Basic Info
ar: معلومات اساسية

# warehouses
source: Warehouse
ar: المستودعات

# companyOrPersonalName
source: Company / Personal Name
ar: اسم الفرد/شركة

# modifiedBy
source: Status changed by:
ar: تم تعديله بواسطة:

source: Arrived Shipment
ar: الشحنات الواصلة

source: Free Capacity
ar: السعة الحرة

source: Free Weight
ar: الوزن الحر

source: Shipment Cost
ar: مصاريف الشحنة

# receiver
source: Receivers
ar: المستلمون

source: Serial Number:
ar: الرقم السري:

# holder
source: Holders
ar: الحاملات

# shipmentReport
source: Shipments Reports
ar: تقارير الشحنات

source: Reports
ar: التقارير

# flight
source: Flight Travels
ar: الرحلات الجوية

# cruise
source: Cruise Travels
ar: الرحلات البحرية

source: Total
ar: الكلي

# airwaybillUploaded
source: this Air waybill has been uploaded to travel
ar: تم تحميل بوليصة الشحن الى الرحلة

# uploadAirwaybill
source: Upload Air waybill to travel
ar: تحميل البوليصة الى الرحلة

# uploadContainer
source: Upload Container to travel
ar: تحميل الحاوية الى الرحلة

# airwaybillArrived
source: this Air Waybill arrived to target warehouse
ar: تم الوصول الى المستودع الهدف

# containerArrived
source: this Container arrived to target warehouse
ar: تم وصول الحاوية الى المستودع الهدف

source: Email Or Phone
ar: رقم الهاتف أو البريد الإلكتروني

source: Job Description
ar: وصف العمل

source: Show Library
ar: المعرض

source: Camera
ar: الكاميرا

# attached
source: Document Attached
ar: الوثائق المرفقة

source: Show status
ar: الحالة

source: Shipment QR
ar: رمز الشحنة

source: Show QR
ar: إظهار الرمز

source: Shipment Sticker
ar: ملصق الشحنة

# shipmentReceived
source: Shipments received in warehouse
ar: الشحنات المستلمة

# shipmentNotDelivered
source: Shipments not delivered to client yet
ar: الشحنات غير المُسلمة الى الزيون

# shipmentDelivered
source: Shipments delivered to client
ar: الشحنات المُسلمة الى الزبون

# writeDetails
source: Write a Details about this status
ar: اكتب ملاحظة عن هذه المرحلة

source: Amount
ar: الكمية

source: Shipment separation
ar: فصل الشحنة

source: Choose Travel
ar: اختر الرحلة

source: Choose Container
ar: اختر حاوية

source: Guni Quantity
ar: عدد الجوني

source: Volume
ar: حجم

source: Import Warehouse
ar: مستودع التسلم

source: Packing by
ar: غُلفت

source: Date
ar: التاريخ

source: From
ar: من

source: To
ar: الى

source: Search Here...
ar: ابحث هنا...

source: Select Warehouse
ar: اختر المستودع

source: Update Travel
ar: تعديل رحلة

source: Travel Information
ar: معلومات الرحلة

# holderInfo
source: Holder Information
ar: معلومات الحاملة

# noHolder
source: No holder has been added to this trip
ar: لا يوجد حاملات داخل الرحلة

# waitingTrip
source: the Trip waiting
ar: الرحلة تنتظر

# notStartedTrip
source: This trip hasn't started yet
ar: لم تبدأهذه الرحلة بعد

# startedTrip
source: the Trip started
ar: بدات الرحلة

# startTrip
source: This trip has started at
ar: بدأت هذه الرحلة في

# releasedTrip
source: the Trip released
ar: الرحلة وصلت

# arriveTrip
source: This trip has arrived at
ar: وصلت هذه الرحلة في

source: Travel Status
ar: حالة الرحلة

source: Released
ar: وصلت

source: shipping
ar: الشحن

source: Warehouse Finance
ar: مصاريف مستودع

source: Update warehouse
ar: تعديل مستودع

source: Local
ar: محلي

# proxy
source: Agent
ar: وكيل

# enterNumber
source: Enter the track number
ar: ادخل رقم التتبع

# shipmentAccepted
source: Shipment accepted successfully
ar: تم قبول الشحنة بنجاح

# shipmentReceivedS
source: The shipment was received from the supplier in the warehouse
ar: تم استلام الشحنة من المورد في المستودع

# shipmentMeasurement
source: The packaging and measurement phase has been completed
ar: تم الانتهاء من مرحلة التعبئة والقياس

# shipmentUploadedHolder
source: The shipment was loaded into a holder
ar: تم تحميل الشحنة في حامل

# shipmentUploadedToTravel
source: The shipment was loaded into a travel
ar: تم تحميل الشحنة في رحلة

# travelStarted
source: The travel has started
ar: لقد بدأت الرحلة

# travelArrived
source: the travel has arrived the destination country
ar: وصلت الرحلة إلى بلد الهدف

# containerCleared
source: The holder has cleared
ar: تم جمركة الحاملة

# shipmentArrived
source: The shipment has arrived to warehouse
ar: وصلت الشحنة إلى المستودع الهدف

# shipmentWaiting
source: Shipment waiting for acceptance
ar: الشحنة في انتظار القبول

source: Update Air waybill
ar: تعديل بوصيلة الشحن

source: Update Container
ar: تعديل الحاوية

# changeStatusConfirm
source: Do you really want to move to the next state ?
ar: هل تريد حقا الإنتقال الى الحالة التالية ؟

# careful
source: Please be careful
ar: رجاءا كن حذر

# emptyAmount
source: You can leave the field blank, if the shipment is not divided
ar: يمكنك ترك الحقل فارغًا ، إذا لم يتم تقسيم الشحنة

# acceptedConfirm
source: Do you really want to accept the shipment ?
ar: هل تريد حقا قبول الشحنة؟

# rejectConfirm
source: Do you really want to reject the shipment ?
ar: هل تريد حقا رفض الشحنة؟

source: Request Container
ar: طلب حاوية

source: Review Information
ar: مراجعة المعلومات

source: Holder count
ar: عدد الحاملات

source: Request Air waybill
ar: طلب بوليصة شحن جوي

source: choose Air waybill
ar: اختبر بوليصة الشحن الجوي

source: Choose Gunny
ar: اختر جوني

source: Gunny Number
ar: رقم الجوني

# gunnyFull
source: Gunny is full
ar: امتلئ الجوني

# completedStored
source: Shipment Stored completely in Gunny
ar: الشحنة خُزنت بالكامل ضمن الجوني

source: Remained Quantity
ar: العدد المتبقي

source: More
ar: المزيد

source: Operation completed successfully
ar: تم العملية بنجاح

# deleteClient
source: Do you really want to delete this employee and revoke all his permissions
ar: هل تريد حقا حذف هذا الموظف وإلغاء جميع صلاحياته

source: Unit Quantity
ar: عدد الواحدات

source: Select Provider
ar: أختر المُقَدِم

source: Select Mark
ar: أختر علامة

source: Our warehouse
ar: مستودعاتنا

source: yes
ar: نعم

source: no
ar: كلا

source: Harbors
ar: الموانئ

# totalShipment
source: Total carton
ar: عدد الكراتين

source: Sea Port
ar: ميناء بحري

source: Air Port
ar: ميناء جوي

source: Prices
ar: الأسعار

source: Update harbor
ar: تعديل الميناء

# shipmentShifting
source: Shifting Shipment
ar: الشحنات المحولة

source: Shifting From
ar: تحولت من

source: Shifting To
ar: تحولت الى

source: Payment type
ar: طريقة الدفع

# addCostConfirm
source: Do you want to add these costs?
ar: هل تريد اضافة هذه المصاريف؟

source: Enter container number
ar: أدخل رقم الحاوية

source: Enter airway bill number
ar: أدخل رقم يوليصة الشحن

# confirmAddCountry
source: Do you really want to add this country?
ar: هل تريد حقا إضافى هذه الدولة

source: Selling cost
ar: سعر المبيع

source: Buying cost
ar: سعر الشراء

source: One kilo price
ar: سعر الكليو الواحد

source: One CBM price
ar: سعر CBM واحد
